### Basic SQL

In [1]:
%load_ext sql
import pandas as pd
%sql sqlite://

'Connected: None@None'

In [2]:
# For compatibility across multiple platforms
import os
IB = os.environ.get('INSTABASE_URI',None) is not None
open = ib.open if IB else open

In [3]:
# Load tables from CSV files
# Cities
with open('Cities.csv','rU') as f:
    Cities = pd.read_csv(f, index_col=0, encoding='utf-8')
%sql drop table if exists Cities;
%sql persist Cities
# Countries
with open('Countries.csv','rU') as f:
    Countries = pd.read_csv(f, index_col=0, encoding='utf-8')
%sql drop table if exists Countries;
%sql persist Countries
# Players
with open('Players.csv','rU') as f:
    Players = pd.read_csv(f, index_col=0, encoding='utf-8')
%sql drop table if exists Players;
%sql persist Players
# Teams
with open('Teams.csv','rU') as f:
    Teams = pd.read_csv(f, index_col=0, encoding='utf-8')
%sql drop table if exists Teams;
%sql persist Teams

Done.
Done.
Done.
Done.

/usr/local/lib/python3.5/dist-packages/ipykernel_launcher.py:3: DeprecationWarning: 'U' mode is deprecated
  This is separate from the ipykernel package so we can avoid doing imports until
/usr/local/lib/python3.5/dist-packages/ipykernel_launcher.py:8: DeprecationWarning: 'U' mode is deprecated

/usr/local/lib/python3.5/dist-packages/ipykernel_launcher.py:13: DeprecationWarning: 'U' mode is deprecated
  del sys.path[0]
/usr/local/lib/python3.5/dist-packages/ipykernel_launcher.py:18: DeprecationWarning: 'U' mode is deprecated

'Persisted teams'

#### Look at sample of Cities and Countries tables

In [4]:
%%sql
select * from Cities limit 5

Done.

[('Aalborg', 'Denmark', 57.03, 9.92, 7.52),
 ('Aberdeen', 'United Kingdom', 57.17, -2.08, 8.1),
 ('Abisko', 'Sweden', 63.35, 18.83, 0.2),
 ('Adana', 'Turkey', 36.99, 35.32, 18.67),
 ('Albacete', 'Spain', 39.0, -1.87, 12.62)]

In [5]:
%%sql
select * from Countries limit 5

Done.

[('Albania', 2.9, 'no', 'yes'),
 ('Andorra', 0.07, 'no', 'no'),
 ('Austria', 8.57, 'yes', 'no'),
 ('Belarus', 9.48, 'no', 'no'),
 ('Belgium', 11.37, 'yes', 'yes')]

### Basic Select statement
Select columns  
From tables  
Where condition

*Find all countries not in the EU*

In [6]:
%%sql
select country
from Countries
where EU = 'no'

Done.

[('Albania',),
 ('Andorra',),
 ('Belarus',),
 ('Bosnia and Herzegovina',),
 ('Iceland',),
 ('Kosovo',),
 ('Liechtenstein',),
 ('Macedonia',),
 ('Moldova',),
 ('Montenegro',),
 ('Norway',),
 ('Serbia',),
 ('Switzerland',),
 ('Turkey',),
 ('Ukraine',)]

*Find all cities with temperature between -5 and 5; return city, country, and temperature*

In [7]:
%%sql
select city, country, temperature
from Cities
where temperature > -5 and temperature < 5

Done.

[('Abisko', 'Sweden', 0.2),
 ('Augsburg', 'Germany', 4.54),
 ('Bergen', 'Norway', 1.75),
 ('Bodo', 'Norway', 4.5),
 ('Helsinki', 'Finland', 4.19),
 ('Innsbruck', 'Austria', 4.54),
 ('Kiruna', 'Sweden', -2.2),
 ('Orsha', 'Belarus', 4.93),
 ('Oslo', 'Norway', 2.32),
 ('Oulu', 'Finland', 1.45),
 ('Salzburg', 'Austria', 4.62),
 ('Tallinn', 'Estonia', 4.82),
 ('Tampere', 'Finland', 3.59),
 ('Tartu', 'Estonia', 4.36),
 ('Trondheim', 'Norway', 4.53),
 ('Turku', 'Finland', 4.72),
 ('Uppsala', 'Sweden', 4.17)]

### Ordering

*Modify previous query to sort by temperature*

In [28]:
%%sql
select city, country, temperature
from Cities
where temperature > -5 and temperature < 5 order by temperature

Done.

[('Kiruna', 'Sweden', -2.2),
 ('Abisko', 'Sweden', 0.2),
 ('Oulu', 'Finland', 1.45),
 ('Bergen', 'Norway', 1.75),
 ('Oslo', 'Norway', 2.32),
 ('Tampere', 'Finland', 3.59),
 ('Uppsala', 'Sweden', 4.17),
 ('Helsinki', 'Finland', 4.19),
 ('Tartu', 'Estonia', 4.36),
 ('Bodo', 'Norway', 4.5),
 ('Trondheim', 'Norway', 4.53),
 ('Augsburg', 'Germany', 4.54),
 ('Innsbruck', 'Austria', 4.54),
 ('Salzburg', 'Austria', 4.62),
 ('Turku', 'Finland', 4.72),
 ('Tallinn', 'Estonia', 4.82),
 ('Orsha', 'Belarus', 4.93)]

*Modify previous query to sort by country, then temperature descending*

In [29]:
%%sql
select city, country, temperature
from Cities
where temperature > -5 and temperature < 5 order by country, temperature desc

Done.

[('Salzburg', 'Austria', 4.62),
 ('Innsbruck', 'Austria', 4.54),
 ('Orsha', 'Belarus', 4.93),
 ('Tallinn', 'Estonia', 4.82),
 ('Tartu', 'Estonia', 4.36),
 ('Turku', 'Finland', 4.72),
 ('Helsinki', 'Finland', 4.19),
 ('Tampere', 'Finland', 3.59),
 ('Oulu', 'Finland', 1.45),
 ('Augsburg', 'Germany', 4.54),
 ('Trondheim', 'Norway', 4.53),
 ('Bodo', 'Norway', 4.5),
 ('Oslo', 'Norway', 2.32),
 ('Bergen', 'Norway', 1.75),
 ('Uppsala', 'Sweden', 4.17),
 ('Abisko', 'Sweden', 0.2),
 ('Kiruna', 'Sweden', -2.2)]

### <font color = 'green'>Your Turn</font>

*Find all countries with no coastline and with population > 9. Return the country and population, in descending order of population.*

In [30]:
%%sql
select country, population
from Countries
where coastline = 'no' and population > 9
order by population desc

Done.

[('Czech Republic', 10.55), ('Hungary', 9.82), ('Belarus', 9.48)]

### Multiple tables in From clause - Joins

*Find all cities with longitude < 10 not in the EU, return city and longitude*

In [9]:
%%sql
select city, longitude
from Cities, Countries
where Cities.country = Countries.country
and longitude < 10 and EU = 'no'

Done.

[('Andorra', 1.52),
 ('Basel', 7.59),
 ('Bergen', 5.32),
 ('Geneva', 6.14),
 ('Stavanger', 5.68),
 ('Zurich', 8.56)]

*Modify previous query to also return country (error then fix)*

*Find all cities with latitude < 50 in a country with population < 5; return city, country, and population, sorted by country*

In [10]:
%%sql
select city, Cities.country, population
from Cities, Countries
where Cities.country = Countries.country
and latitude < 50 and population < 5
order by Cities.country

Done.

[('Elbasan', 'Albania', 2.9),
 ('Andorra', 'Andorra', 0.07),
 ('Sarajevo', 'Bosnia and Herzegovina', 3.8),
 ('Rijeka', 'Croatia', 4.23),
 ('Split', 'Croatia', 4.23),
 ('Skopje', 'Macedonia', 2.08),
 ('Balti', 'Moldova', 4.06),
 ('Chisinau', 'Moldova', 4.06),
 ('Podgorica', 'Montenegro', 0.63),
 ('Ljubljana', 'Slovenia', 2.07)]

#### Inner Join -- just FYI

*Same query as above*

In [11]:
%%sql
select city, Cities.country, population
from Cities inner join Countries
     on Cities.country = Countries.country
where latitude < 50 and population < 5
order by Cities.country

Done.

[('Elbasan', 'Albania', 2.9),
 ('Andorra', 'Andorra', 0.07),
 ('Sarajevo', 'Bosnia and Herzegovina', 3.8),
 ('Rijeka', 'Croatia', 4.23),
 ('Split', 'Croatia', 4.23),
 ('Skopje', 'Macedonia', 2.08),
 ('Balti', 'Moldova', 4.06),
 ('Chisinau', 'Moldova', 4.06),
 ('Podgorica', 'Montenegro', 0.63),
 ('Ljubljana', 'Slovenia', 2.07)]

### Select *

*Modify previous queries to return all attributes*

In [31]:
%%sql
select *
from Cities inner join Countries
    on Cities.country = Countries.country
where latitude < 50 and population < 5
order by Cities.country

Done.

[('Elbasan', 'Albania', 41.12, 20.08, 15.18, 'Albania', 2.9, 'no', 'yes'),
 ('Andorra', 'Andorra', 42.5, 1.52, 9.6, 'Andorra', 0.07, 'no', 'no'),
 ('Sarajevo', 'Bosnia and Herzegovina', 43.85, 13.38, 9.6, 'Bosnia and Herzegovina', 3.8, 'no', 'yes'),
 ('Rijeka', 'Croatia', 45.33, 14.45, 9.27, 'Croatia', 4.23, 'yes', 'yes'),
 ('Split', 'Croatia', 43.52, 16.47, 12.46, 'Croatia', 4.23, 'yes', 'yes'),
 ('Skopje', 'Macedonia', 42.0, 21.43, 9.36, 'Macedonia', 2.08, 'no', 'no'),
 ('Balti', 'Moldova', 47.76, 27.91, 8.23, 'Moldova', 4.06, 'no', 'no'),
 ('Chisinau', 'Moldova', 47.01, 28.86, 8.6, 'Moldova', 4.06, 'no', 'no'),
 ('Podgorica', 'Montenegro', 42.47, 19.27, 9.99, 'Montenegro', 0.63, 'no', 'yes'),
 ('Ljubljana', 'Slovenia', 46.06, 14.51, 9.27, 'Slovenia', 2.07, 'yes', 'yes')]

### <font color = 'green'>Your Turn</font>

*Find all cities with latitude > 45 in a country with no coastline and with population > 9. Return the city, country, latitude, and whether it's in the EU.*

In [32]:
%%sql
select city, Cities.country, latitude, EU
from Cities inner join Countries
    on Cities.country = Countries.country
where latitude > 45 and coastline = 'no' and population > 9

Done.

[('Brest', 'Belarus', 52.1, 'no'),
 ('Brno', 'Czech Republic', 49.2, 'yes'),
 ('Budapest', 'Hungary', 47.5, 'yes'),
 ('Debrecen', 'Hungary', 47.53, 'yes'),
 ('Gyor', 'Hungary', 47.7, 'yes'),
 ('Hrodna', 'Belarus', 53.68, 'no'),
 ('Mazyr', 'Belarus', 52.05, 'no'),
 ('Minsk', 'Belarus', 53.9, 'no'),
 ('Orsha', 'Belarus', 54.52, 'no'),
 ('Ostrava', 'Czech Republic', 49.83, 'yes'),
 ('Pinsk', 'Belarus', 52.13, 'no'),
 ('Prague', 'Czech Republic', 50.08, 'yes'),
 ('Szeged', 'Hungary', 46.25, 'yes')]

### Aggregation and Grouping

*Find average temperature for all cities*

In [13]:
%%sql
select avg(temperature)
from Cities

Done.

[(9.497840375586858,)]

*Modify previous query to find average temperature of cities with latitude > 55*

In [33]:
%%sql
select avg(temperature)
from Cities
where latitude > 55

Done.

[(4.985185185185185,)]

*Modify previous query to also find minimum and maxiumum temperature of cities with latitude > 55*

In [34]:
%%sql
select max(temperature), min(temperature)
from Cities
where latitude > 55

Done.

[(8.6, -2.2)]

*Modify previous query to return number of cities with latitude > 55*

In [35]:
%%sql
select count(city)
from Cities
where latitude > 55

Done.

[(27,)]

*Rename result column as northerns*

In [36]:
%%sql
select count(city) as northerns
from Cities
where latitude > 55

Done.

[(27,)]

*Find minimum and maximum temperature of cities in the EU (then not in the EU)*

In [37]:
%%sql
select min(temperature), max(temperature)
from Cities, Countries
where Cities.country = Countries.country
and EU = 'yes'

Done.

[(-2.2, 17.9)]

In [38]:
%%sql
select min(temperature), max(temperature)
from Cities, Countries
where Cities.country = Countries.Country
and EU = 'yes'

Done.

[(-2.2, 17.9)]

### <font color = 'green'>Your Turn</font>

*Find the number of cities with latitude > 45 in a country with no coastline and with population > 9. Return the number of cities along with their minimum and maximum latitude.*

In [39]:
%%sql
select count(city) as 'number of cities', min(latitude) as 'minimum latitude', max(latitude) as 'maximum latitude'
from Cities inner join Countries
    on Cities.country = Countries.country
where latitude > 45 and coastline = 'no' and population > 9

Done.

[(13, 46.25, 54.52)]

*Find average temperature for each country*

In [16]:
%%sql
select country, avg(temperature)
from Cities
group by country

Done.

[('Albania', 15.18),
 ('Andorra', 9.6),
 ('Austria', 6.144),
 ('Belarus', 5.946666666666666),
 ('Belgium', 9.65),
 ('Bosnia and Herzegovina', 9.6),
 ('Bulgaria', 10.44),
 ('Croatia', 10.865),
 ('Czech Republic', 7.8566666666666665),
 ('Denmark', 7.625),
 ('Estonia', 4.59),
 ('Finland', 3.4875),
 ('France', 10.151111111111112),
 ('Germany', 7.869285714285714),
 ('Greece', 16.9025),
 ('Hungary', 9.6025),
 ('Ireland', 9.299999999999999),
 ('Italy', 13.474666666666668),
 ('Latvia', 5.27),
 ('Lithuania', 6.1433333333333335),
 ('Macedonia', 9.36),
 ('Moldova', 8.415),
 ('Montenegro', 9.99),
 ('Netherlands', 8.756666666666668),
 ('Norway', 3.7260000000000004),
 ('Poland', 7.250000000000002),
 ('Portugal', 14.469999999999999),
 ('Romania', 9.224444444444444),
 ('Serbia', 9.85),
 ('Slovakia', 8.48),
 ('Slovenia', 9.27),
 ('Spain', 14.238333333333332),
 ('Sweden', 3.5866666666666673),
 ('Switzerland', 7.253333333333333),
 ('Turkey', 11.726666666666665),
 ('Ukraine', 7.420000000000002),
 ('United Kingdom', 8.649999999999999)]

*Modify previous query to sort by descending average temperature*

In [40]:
%%sql
select country, avg(temperature)
from Cities
group by country
order by avg(temperature) desc

Done.

[('Greece', 16.9025),
 ('Albania', 15.18),
 ('Portugal', 14.469999999999999),
 ('Spain', 14.238333333333332),
 ('Italy', 13.474666666666668),
 ('Turkey', 11.726666666666665),
 ('Croatia', 10.865),
 ('Bulgaria', 10.44),
 ('France', 10.151111111111112),
 ('Montenegro', 9.99),
 ('Serbia', 9.85),
 ('Belgium', 9.65),
 ('Hungary', 9.6025),
 ('Andorra', 9.6),
 ('Bosnia and Herzegovina', 9.6),
 ('Macedonia', 9.36),
 ('Ireland', 9.299999999999999),
 ('Slovenia', 9.27),
 ('Romania', 9.224444444444444),
 ('Netherlands', 8.756666666666668),
 ('United Kingdom', 8.649999999999999),
 ('Slovakia', 8.48),
 ('Moldova', 8.415),
 ('Germany', 7.869285714285714),
 ('Czech Republic', 7.8566666666666665),
 ('Denmark', 7.625),
 ('Ukraine', 7.420000000000002),
 ('Switzerland', 7.253333333333333),
 ('Poland', 7.250000000000002),
 ('Austria', 6.144),
 ('Lithuania', 6.1433333333333335),
 ('Belarus', 5.946666666666666),
 ('Latvia', 5.27),
 ('Estonia', 4.59),
 ('Norway', 3.7260000000000004),
 ('Sweden', 3.5866666666666673),
 ('Finland', 3.4875)]

*Modify previous query to show countries only*

In [41]:
%%sql
select country
from Cities
group by country
order by avg(temperature) desc

Done.

[('Greece',),
 ('Albania',),
 ('Portugal',),
 ('Spain',),
 ('Italy',),
 ('Turkey',),
 ('Croatia',),
 ('Bulgaria',),
 ('France',),
 ('Montenegro',),
 ('Serbia',),
 ('Belgium',),
 ('Hungary',),
 ('Andorra',),
 ('Bosnia and Herzegovina',),
 ('Macedonia',),
 ('Ireland',),
 ('Slovenia',),
 ('Romania',),
 ('Netherlands',),
 ('United Kingdom',),
 ('Slovakia',),
 ('Moldova',),
 ('Germany',),
 ('Czech Republic',),
 ('Denmark',),
 ('Ukraine',),
 ('Switzerland',),
 ('Poland',),
 ('Austria',),
 ('Lithuania',),
 ('Belarus',),
 ('Latvia',),
 ('Estonia',),
 ('Norway',),
 ('Sweden',),
 ('Finland',)]

*Modify previous query to find average temperature for cities in countries with and without coastline, then cities in the EU and not in the EU, then all combinations*

In [42]:
%%sql
select Cities.country, avg(temperature)
from Cities inner join Countries
    on Cities.country = Countries.country
where coastline = 'no'
group by Cities.country

Done.

[('Andorra', 9.6),
 ('Austria', 6.144),
 ('Belarus', 5.946666666666666),
 ('Czech Republic', 7.8566666666666665),
 ('Hungary', 9.6025),
 ('Macedonia', 9.36),
 ('Moldova', 8.415),
 ('Serbia', 9.85),
 ('Slovakia', 8.48),
 ('Switzerland', 7.253333333333333)]

In [43]:
%%sql
select Cities.country, avg(temperature)
from Cities inner join Countries
    on Cities.country = Countries.country
where coastline = 'yes'
group by Cities.country

Done.

[('Albania', 15.18),
 ('Belgium', 9.65),
 ('Bosnia and Herzegovina', 9.6),
 ('Bulgaria', 10.44),
 ('Croatia', 10.865),
 ('Denmark', 7.625),
 ('Estonia', 4.59),
 ('Finland', 3.4875),
 ('France', 10.151111111111112),
 ('Germany', 7.869285714285714),
 ('Greece', 16.9025),
 ('Ireland', 9.299999999999999),
 ('Italy', 13.474666666666668),
 ('Latvia', 5.27),
 ('Lithuania', 6.1433333333333335),
 ('Montenegro', 9.99),
 ('Netherlands', 8.756666666666668),
 ('Norway', 3.7260000000000004),
 ('Poland', 7.250000000000002),
 ('Portugal', 14.469999999999999),
 ('Romania', 9.224444444444444),
 ('Slovenia', 9.27),
 ('Spain', 14.238333333333332),
 ('Sweden', 3.5866666666666673),
 ('Turkey', 11.726666666666665),
 ('Ukraine', 7.420000000000002),
 ('United Kingdom', 8.649999999999999)]

In [44]:
%%sql
select Cities.country, avg(temperature)
from Cities inner join Countries
    on Cities.country = Countries.country
where EU = 'yes'
group by Cities.country

Done.

[('Austria', 6.144),
 ('Belgium', 9.65),
 ('Bulgaria', 10.44),
 ('Croatia', 10.865),
 ('Czech Republic', 7.8566666666666665),
 ('Denmark', 7.625),
 ('Estonia', 4.59),
 ('Finland', 3.4875),
 ('France', 10.151111111111112),
 ('Germany', 7.869285714285714),
 ('Greece', 16.9025),
 ('Hungary', 9.6025),
 ('Ireland', 9.299999999999999),
 ('Italy', 13.474666666666668),
 ('Latvia', 5.27),
 ('Lithuania', 6.1433333333333335),
 ('Netherlands', 8.756666666666668),
 ('Poland', 7.250000000000002),
 ('Portugal', 14.469999999999999),
 ('Romania', 9.224444444444444),
 ('Slovakia', 8.48),
 ('Slovenia', 9.27),
 ('Spain', 14.238333333333332),
 ('Sweden', 3.5866666666666673),
 ('United Kingdom', 8.649999999999999)]

In [45]:
%%sql
select Cities.country, avg(temperature)
from Cities inner join Countries
    on Cities.country = Countries.country
where EU = 'no'
group by Cities.country

Done.

[('Albania', 15.18),
 ('Andorra', 9.6),
 ('Belarus', 5.946666666666666),
 ('Bosnia and Herzegovina', 9.6),
 ('Macedonia', 9.36),
 ('Moldova', 8.415),
 ('Montenegro', 9.99),
 ('Norway', 3.7260000000000004),
 ('Serbia', 9.85),
 ('Switzerland', 7.253333333333333),
 ('Turkey', 11.726666666666665),
 ('Ukraine', 7.420000000000002)]

In [46]:
%%sql
select coastline, EU, avg(temperature)
from Cities inner join Countries
    on Cities.country = Countries.country
group by coastline, EU

Done.

[('no', 'no', 7.67375),
 ('no', 'yes', 7.832857142857144),
 ('yes', 'no', 9.492340425531914),
 ('yes', 'yes', 9.885735294117652)]

*Modify previous query to only include cities with latitude < 50, then latitude < 40*

### <font color = 'green'>Your Turn</font>

*For each country in the EU, find the latitude of the northernmost city in the country, i.e., the maximum latitude. Return the country and its maximum latitude, in descending order of maximum latitude.*

In [17]:
%%sql
YOUR QUERY HERE

(sqlite3.OperationalError) near "YOUR": syntax error [SQL: 'YOUR QUERY HERE']

### The Limit clause

*Return any three countries with population > 20*

In [18]:
%%sql
select country
from Countries
where population > 20
limit 3

Done.

[('France',), ('Germany',), ('Italy',)]

*Find the ten coldest cities*

In [19]:
%%sql
select city, temperature
from Cities
order by temperature
limit 10

Done.

[('Kiruna', -2.2),
 ('Abisko', 0.2),
 ('Oulu', 1.45),
 ('Bergen', 1.75),
 ('Oslo', 2.32),
 ('Tampere', 3.59),
 ('Uppsala', 4.17),
 ('Helsinki', 4.19),
 ('Tartu', 4.36),
 ('Bodo', 4.5)]

### <font color = 'green'>Your Turn - Basic SQL on World Cup Data</font>

#### Look at sample of Players and Teams tables

In [20]:
%%sql
select * from Players limit 5

Done.

[('Abdoun', 'Algeria', 'midfielder', 16, 0, 6, 0, 0),
 ('Belhadj', 'Algeria', 'defender', 270, 1, 146, 8, 0),
 ('Boudebouz', 'Algeria', 'midfielder', 74, 3, 28, 1, 0),
 ('Bougherra', 'Algeria', 'defender', 270, 1, 89, 11, 0),
 ('Chaouchi', 'Algeria', 'goalkeeper', 90, 0, 17, 0, 2)]

In [21]:
%%sql
select * from Teams limit 5

Done.

[('Brazil', 1, 5, 3, 1, 1, 9, 4, 7, 2),
 ('Spain', 2, 6, 5, 0, 1, 7, 2, 3, 0),
 ('Portugal', 3, 4, 1, 2, 1, 7, 1, 8, 1),
 ('Netherlands', 4, 6, 6, 0, 0, 12, 5, 15, 0),
 ('Italy', 5, 3, 0, 2, 1, 4, 5, 5, 0)]

*1)  What player on a team with “ia” in the team name played less than 200 minutes and made more than 100 passes? Return the player surname. Note: To check if attribute A contains string S use "A like '%S%'"*

In [22]:
%%sql
select surname
from Players
where team LIKE "%ia%" and minutes < 200 and passes > 100

Done.

[('Kuzmanovic',)]

*2) Find all players who made more than 20 shots. Return all player information in descending order of shots made.*

In [23]:
%%sql
select *
from Players
where shots > 20
order by shots desc

Done.

[('Gyan', 'Ghana', 'forward', 501, 27, 151, 1, 0),
 ('Villa', 'Spain', 'forward', 529, 22, 169, 2, 0),
 ('Messi', 'Argentina', 'forward', 450, 21, 321, 10, 0)]

*3) Find the goalkeepers of teams that played more than four games. List the surname of the goalkeeper, the team, and the number of minutes the goalkeeper played.*

In [24]:
%%sql
select surname, Players.team, minutes
from Players inner join Teams
    on Players.team = Teams.team
where position = 'goalkeeper' and games > 4

Done.

[('Romero', 'Argentina', 450),
 ('Julio Cesar', 'Brazil', 450),
 ('Neuer', 'Germany', 540),
 ('Kingson', 'Ghana', 510),
 ('Stekelenburg', 'Netherlands', 540),
 ('Villar', 'Paraguay', 480),
 ('Casillas', 'Spain', 540),
 ('Muslera', 'Uruguay', 570)]

*4) How many players who play on a team with ranking <10 played more than 350 minutes? Return one number in a column named 'superstar'.*

In [25]:
%%sql
select count(surname) as superstar
from Players inner join Teams
    on Players.team = Teams.team
where ranking < 10 and minutes > 350

Done.

[(54,)]

*5) What is the average number of passes made by forwards? By midfielders? Write one query that gives both values.*

In [26]:
%%sql
select position, avg(passes)
from Players
where position = 'forward' or position = 'midfielder'
group by position

Done.

[('forward', 50.82517482517483), ('midfielder', 95.2719298245614)]

*6) Find the ten players who have the highest number of shots + tackles. For each one return surname, team, position, and shots+tackles. Note: You can do arithmetic in Select and Order By clauses*

In [49]:
%%sql
select surname, team, position, shots+tackles
from Players
order by shots+tackles desc
limit 10

Done.

[('Perez', 'Uruguay', 'midfielder', 36),
 ('van Bommel', 'Netherlands', 'midfielder', 33),
 ('Boateng', 'Ghana', 'midfielder', 32),
 ('Messi', 'Argentina', 'forward', 31),
 ('Schweinsteiger', 'Germany', 'midfielder', 28),
 ('Gyan', 'Ghana', 'forward', 28),
 ('Riveros', 'Paraguay', 'midfielder', 27),
 ('Alonso', 'Spain', 'midfielder', 27),
 ('Podolski', 'Germany', 'forward', 26),
 ('Arevalo Rios', 'Uruguay', 'midfielder', 26)]